---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.SetLoadClassifications(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
source: html/1394dc62-5e84-151a-e801-5556d66f6aea.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.SetLoadClassifications Method

Sets the Load Classifications associated with this panel schedule

## Syntax (C#)
```csharp
public void SetLoadClassifications(
	IList<ElementId> loadClassificaions
)
```

## Parameters
- **loadClassificaions** (`System.Collections.Generic.IList < ElementId >`) - The load classifications to assign

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null